sobriodev/LEGO_SmartCity/board/pin_mux.c
	const uint32_t port2_pin26_config = (/* Pin is configured as PIO2_26 */
			IOCON_PIO_FUNC0 |
			/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT2 PIN26 (coords: H11) is configured as PIO2_26 */
	IOCON_PinMuxSet(IOCON, 2U, 26U, port2_pin26_config);

	const uint32_t port4_pin10_config = (/* Pin is configured as ENET_RX_DV */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN10 (coords: B9) is configured as ENET_RX_DV */
	IOCON_PinMuxSet(IOCON, 4U, 10U, port4_pin10_config);

	const uint32_t port4_pin11_config = (/* Pin is configured as ENET_RXD0 */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN11 (coords: A9) is configured as ENET_RXD0 */
	IOCON_PinMuxSet(IOCON, 4U, 11U, port4_pin11_config);

	const uint32_t port4_pin12_config = (/* Pin is configured as ENET_RXD1 */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN12 (coords: A6) is configured as ENET_RXD1 */
	IOCON_PinMuxSet(IOCON, 4U, 12U, port4_pin12_config);

	const uint32_t port4_pin13_config = (/* Pin is configured as ENET_TX_EN */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN13 (coords: B6) is configured as ENET_TX_EN */
	IOCON_PinMuxSet(IOCON, 4U, 13U, port4_pin13_config);

	const uint32_t port4_pin14_config = (/* Pin is configured as ENET_RX_CLK */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN14 (coords: B5) is configured as ENET_RX_CLK */
	IOCON_PinMuxSet(IOCON, 4U, 14U, port4_pin14_config);

	const uint32_t port4_pin15_config = (/* Pin is configured as ENET_MDC */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN15 (coords: A4) is configured as ENET_MDC */
	IOCON_PinMuxSet(IOCON, 4U, 15U, port4_pin15_config);

	const uint32_t port4_pin16_config = (/* Pin is configured as ENET_MDIO */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN16 (coords: C4) is configured as ENET_MDIO */
	IOCON_PinMuxSet(IOCON, 4U, 16U, port4_pin16_config);

	const uint32_t port4_pin8_config = (/* Pin is configured as ENET_TXD0 */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT4 PIN8 (coords: B14) is configured as ENET_TXD0 */
	IOCON_PinMuxSet(IOCON, 4U, 8U, port4_pin8_config);

	const uint32_t port0_pin15_config = (/* Pin is configured as EMC_WEN */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN15 (coords: L4) is configured as EMC_WEN */
	IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);

	const uint32_t port0_pin18_config = (/* Pin is configured as EMC_A(0) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN18 (coords: C14) is configured as EMC_A(0) */
	IOCON_PinMuxSet(IOCON, 0U, 18U, port0_pin18_config);

	const uint32_t port0_pin19_config = (/* Pin is configured as EMC_A(1) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN19 (coords: C6) is configured as EMC_A(1) */
	IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);

	const uint32_t port0_pin2_config = (/* Pin is configured as EMC_D(0) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN2 (coords: E9) is configured as EMC_D(0) */
	IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

	const uint32_t port0_pin20_config = (/* Pin is configured as EMC_A(2) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN20 (coords: D13) is configured as EMC_A(2) */
	IOCON_PinMuxSet(IOCON, 0U, 20U, port0_pin20_config);

	const uint32_t port0_pin21_config = (/* Pin is configured as EMC_A(3) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN21 (coords: C13) is configured as EMC_A(3) */
	IOCON_PinMuxSet(IOCON, 0U, 21U, port0_pin21_config);

	const uint32_t port0_pin29_config = (/* Pin is configured as FC0_RXD_SDA_MOSI */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN29 (coords: B13) is configured as FC0_RXD_SDA_MOSI */
	IOCON_PinMuxSet(IOCON, 0U, 29U, port0_pin29_config);

	const uint32_t port0_pin3_config = (/* Pin is configured as EMC_D(1) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN3 (coords: A10) is configured as EMC_D(1) */
	IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);

