sobriodev/LEGO_SmartCity/board/pin_mux.c
       	const uint32_t port0_pin25_config = (/* Pin is configured as SPIFI_IO(1) */
       			IOCON_PIO_FUNC6 |
       			/* Selects pull-up function */
       			IOCON_PIO_MODE_PULLUP |
       			/* Input function is not inverted */
       			IOCON_PIO_INV_DI |
       			/* Enables digital function */
       			IOCON_PIO_DIGITAL_EN |
       			/* Input filter disabled */
       			IOCON_PIO_INPFILT_OFF |
       			/* Standard mode, output slew rate control is enabled */
       			IOCON_PIO_SLEW_STANDARD |
       			/* Open drain is disabled */
       			IOCON_PIO_OPENDRAIN_DI);
       	/* PORT0 PIN25 (coords: K8) is configured as SPIFI_IO(1) */
       	IOCON_PinMuxSet(IOCON, 0U, 25U, port0_pin25_config);

       	const uint32_t port0_pin26_config = (/* Pin is configured as SPIFI_CLK */
       			IOCON_PIO_FUNC6 |
       			/* Selects pull-up function */
       			IOCON_PIO_MODE_PULLUP |
       			/* Input function is not inverted */
       			IOCON_PIO_INV_DI |
       			/* Enables digital function */
       			IOCON_PIO_DIGITAL_EN |
       			/* Input filter disabled */
       			IOCON_PIO_INPFILT_OFF |
       			/* Standard mode, output slew rate control is enabled */
       			IOCON_PIO_SLEW_STANDARD |
       			/* Open drain is disabled */
       			IOCON_PIO_OPENDRAIN_DI);
       	/* PORT0 PIN26 (coords: M13) is configured as SPIFI_CLK */
       	IOCON_PinMuxSet(IOCON, 0U, 26U, port0_pin26_config);

       	const uint32_t port0_pin27_config = (/* Pin is configured as SPIFI_IO(3) */
       			IOCON_PIO_FUNC6 |
       			/* Selects pull-up function */
       			IOCON_PIO_MODE_PULLUP |
       			/* Input function is not inverted */
       			IOCON_PIO_INV_DI |
       			/* Enables digital function */
       			IOCON_PIO_DIGITAL_EN |
       			/* Input filter disabled */
       			IOCON_PIO_INPFILT_OFF |
       			/* Standard mode, output slew rate control is enabled */
       			IOCON_PIO_SLEW_STANDARD |
       			/* Open drain is disabled */
       			IOCON_PIO_OPENDRAIN_DI);
       	/* PORT0 PIN27 (coords: L9) is configured as SPIFI_IO(3) */
       	IOCON_PinMuxSet(IOCON, 0U, 27U, port0_pin27_config);

       	const uint32_t port0_pin28_config = (/* Pin is configured as SPIFI_IO(2) */
       			IOCON_PIO_FUNC6 |
       			/* Selects pull-up function */
       			IOCON_PIO_MODE_PULLUP |
       			/* Input function is not inverted */
       			IOCON_PIO_INV_DI |
       			/* Enables digital function */
       			IOCON_PIO_DIGITAL_EN |
       			/* Input filter disabled */
       			IOCON_PIO_INPFILT_OFF |
       			/* Standard mode, output slew rate control is enabled */
       			IOCON_PIO_SLEW_STANDARD |
       			/* Open drain is disabled */
       			IOCON_PIO_OPENDRAIN_DI);
       	/* PORT0 PIN28 (coords: M9) is configured as SPIFI_IO(2) */
       	IOCON_PinMuxSet(IOCON, 0U, 28U, port0_pin28_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUserPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: J14, peripheral: SCT0, signal: 'OUT, 5', pin_signal: PIO3_31/FC9_RTS_SCL_SSEL1/SCT0_OUT5/CTIMER4_MAT2/SCT0_GPI0/EMC_A(20)}
  - {pin_num: F11, peripheral: FLEXCOMM1, signal: CTS_SDA_SSEL0, pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CTIMER0_CAP0/SCT0_GPI0/ENET_RXD0}
  - {pin_num: E13, peripheral: FLEXCOMM1, signal: RTS_SCL_SSEL1, pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CTIMER0_CAP1/SCT0_GPI1/ENET_RXD1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitUserPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][13] =
            ((IOCON->PIO[0][13] &
              /* Mask bits to zero which are setting */
              (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_FILTEROFF_MASK | IOCON_PIO_I2CDRIVE_MASK)))

             /* Selects pin function.
              * : PORT013 (pin F11) is configured as FC1_CTS_SDA_SSEL0. */
             | IOCON_PIO_FUNC(PIO013_FUNC_ALT1)

             /* Controls slew rate of I2C pad.
              * : I2C mode. */
             | IOCON_PIO_I2CSLEW(PIO013_I2CSLEW_I2C_MODE)

             /* Select Analog/Digital mode.
              * : Digital mode. */
             | IOCON_PIO_DIGIMODE(PIO013_DIGIMODE_DIGITAL)

             /* Controls input glitch filter.
              * : Filter enabled.
              * Noise pulses below approximately 10 ns are filtered out. */
             | IOCON_PIO_FILTEROFF(PIO013_FILTEROFF_ENABLED)

             /* Controls the current sink capability of the pin.
              * : High drive.
              * Output drive sink is 20 mA.
              * This is needed for Fast Mode Plus I 2C.
              * Refer to the appropriate specific device data sheet for details. */
             | IOCON_PIO_I2CDRIVE(PIO013_I2CDRIVE_HIGH));

        IOCON->PIO[0][14] =
            ((IOCON->PIO[0][14] &
              /* Mask bits to zero which are setting */
              (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_I2CSLEW_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_FILTEROFF_MASK | IOCON_PIO_I2CDRIVE_MASK)))

             /* Selects pin function.
              * : PORT014 (pin E13) is configured as FC1_RTS_SCL_SSEL1. */
             | IOCON_PIO_FUNC(PIO014_FUNC_ALT1)

             /* Controls slew rate of I2C pad.
              * : I2C mode. */
             | IOCON_PIO_I2CSLEW(PIO014_I2CSLEW_I2C_MODE)

             /* Select Analog/Digital mode.
              * : Digital mode. */
             | IOCON_PIO_DIGIMODE(PIO014_DIGIMODE_DIGITAL)

             /* Controls input glitch filter.
              * : Filter enabled.
              * Noise pulses below approximately 10 ns are filtered out. */
             | IOCON_PIO_FILTEROFF(PIO014_FILTEROFF_ENABLED)

             /* Controls the current sink capability of the pin.
              * : High drive.
              * Output drive sink is 20 mA.
              * This is needed for Fast Mode Plus I 2C.
              * Refer to the appropriate specific device data sheet for details. */
             | IOCON_PIO_I2CDRIVE(PIO014_I2CDRIVE_HIGH));

    IOCON->PIO[3][31] = ((IOCON->PIO[3][31] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT331 (pin J14) is configured as SCT0_OUT5. */
                         | IOCON_PIO_FUNC(PIO331_FUNC_ALT2)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO331_DIGIMODE_DIGITAL));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
